***** does using a future do anything helpful?

Futures block once they are dereferenced, it seems?

#+BEGIN_SRC clojure
  (def var2-future
    (future 
      (repeatedly 10 #(do (Thread/sleep 5000)
                           (swap! current-val inc)
                           (ctl var2 :centerpos @current-val)))))
#+END_SRC

#+RESULTS:
: #'user/var2-future

#+BEGIN_SRC clojure :results silent
;; need to reset current-val if previously used!
(def current-val (atom 0))

#+END_SRC

#+BEGIN_SRC clojure :results silent
@var2-future
#+END_SRC

** general-tgrains
#+BEGIN_SRC clojure
;; if not already loaded
  (def goldberg-slow (load-sample "/Users/b/Google Drive/Audio_uploads/wav-file-uploads/goldberg-slow-mono.wav"))


#+END_SRC

#+RESULTS:
: #'user/goldberg-slow#'user/gold

#+BEGIN_SRC clojure :results silent
;; what's in the 11th buffer?
(def gold (general-tgrains-synth goldberg-slow))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(def var1 (general-tgrains-synth 0))
#+END_SRC
** tgrains-line 
[[id:326223F4-AA19-4058-A07C-3E5F5DB9AFF5][use lines and scaling and more MIDI buttons]]

#+BEGIN_SRC clojure
(def var1-line (tgrains-line-synth :buffer goldberg-slow :mult 1))
#+END_SRC

#+RESULTS:
: #'user/var1-line

#+BEGIN_SRC clojure :results silent
(def var3-line (tgrains-line-synth :buffer 7 :mult 1))
#+END_SRC


#+BEGIN_SRC clojure :results silent
(ctl var2-line :buffer 7 :centerpos 0)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl var1-line :trate 2)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl var2-line :trate 1)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl var1-line :duration-mult 1)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl var2-line :dur-numerator 2)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(def var1-noline (general-tgrains-synth :buffer 0 :centerpos 1))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl var1-noline :centerpos (line:kr 0 4 20 FREE))
#+END_SRC
** record-val (to 'liked-values' ref); my maprange; round2; read-ugen

#+BEGIN_SRC clojure
  ;; hard codes in ref for "liked-values"
  (defn record-val [place]
    (swap! liked-values conj (deref place)))

(defn maprange [[a1 a2] [b1 b2] s]
	(+ b1 (/ (* (- s a1) (- b2 b1)) (- a2 a1))))

;; in more recent versions of overtone?
(defn round2
  "Round a double to the given precision (number of significant digits)"
  [precision d]
  (let [factor (Math/pow 10 precision)]
    (/ (Math/round (* d factor)) factor)))

(defmacro read-ugen [dur ugen]
`(run ~dur (poll:kr (impulse:kr 2) ~ugen)))
#+END_SRC

#+RESULTS:
: #'user/record-val#'user/maprange#'user/read-ugen

